12/data/attachments/f33ca80f28fe66ef.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_96174e0f-7c12-4fd6-8959-083d7615408d</nif:username>
            <nif:friendToBeAdded>David_tonight_Friend_23598_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>